[
    {
        "title": "Ströer",
        "year": "2016",
        "duration": "6 months",
        "tags": [
            "AngularJS",
            "SCSS",
            "Java"
        ],
        "previewImg": {
            "src": "img/content/project/preview/stroeer_preview_large.jpg"
        },
        "descriptions": [
            "I started working on Ströer OMS because they were in need of a new calendar. OMS is an internal management platform for maintenance of their billboards. Which has a complex infrastructure. I was working mainly on the frontend, writing templates in Struts (Java template engine), displaying data with AngularJS, and styling with SCSS. Data was retrieved from an API with ajax calls.",
            "The app has several interactive elements: toggle events, display other months and years, showing the daily schedule and printing.",
            "After finishing the calendar, I have been continuing working for Ströer for platform maintenance. I soloed the frontend till couple of months later I established a team of three developer which I was leading."
        ],
        "images": [
            {
                "title": "calendar year view",
                "src": "img/content/project/stroeer/year.jpg"
            },
            {
                "title": "calendar month view",
                "src": "img/content/project/stroeer/month.jpg"
            }
        ]
    },
    {
        "title": "Condor",
        "year": "2016",
        "duration": "4 months",
        "tags": [
            "ARIA",
            "semantic",
            "screen reader"
        ],
        "previewImg": {
            "src": "img/content/project/preview/condor_preview_large.jpg"
        },
        "descriptions": [
            "My journey with Condor airlines was a pleasant one. I took the chance to teach myself a new skill, many developers don't even think or know about it.",
            "Condor part of the Thomas Cook Group is offering a service of public airline booking. In the UK and US it is a law to meet the standard of WCAG level AA for those systems. When this rule got released the booking engine and website needed to be enhanced for people with disabilities till the end of 2015(US) and 2016(UK).",
            "Before making improvements in usability, we needed a tool to measure the current state and every incremental improvement we may make, to reach the goal as fast as possible. We asked a third party service to provide us with reports after every major release, and we used browser tools and screen readers to test our changes. Testing became time intensive through lag of tools.",
            "A big part of the changes had been made in the use of correct context tags, i.e. using buttons instead of links for submitting forms, or ordering headlines h3 cannot come before h2. We added new elements, i.e. skip links and close buttons for layers, and improved tags with aria attributes to describe the seat and prices.",
            "The changes we made until this point were usability improvements for screen-readers, other people with a visual disability and using normal screens seeing mostly fewer colours. The visual designer needed to come up with a new high contrast theme. green changed to orange, white text on coloured background changed to dark gray, blue got darker, active elements needing a highlighted border, and many other changes to increase contrast."
        ],
        "images": [
            {
                "src": "img/content/project/condor/enhanced-navigation.jpg",
                "title": "new elements for better navigation"
            },
            {
                "src": "img/content/project/condor/semantic-elements.jpg",
                "title": "semantically markup"
            },
            {
                "src": "img/content/project/condor/contrast-ratio.gif",
                "title": "contrast ratio"
            }
        ],
        "links": [
            "condor.com"
        ]
    },
    {
        "title": "Gedore",
        "year": "2015",
        "duration": "3 months",
        "tags": [
            "eCommerce",
            "frontend",
            "atomic"
        ],
        "previewImg": {
            "src": "img/content/project/preview/gedore_preview_large.jpg"
        },
        "descriptions": [
            "Here we have three projects for the client Gedore. Everything has been freshly designed and developed. A complete redesign - topic is BOLD. Starting off with the Gedore brand site, presenting news, product catalog, interactive storefinder and many more. Behind the scene is a Typo3 CMS to serve those sites. Website are easily created as the toolbox offers 20+ modules and more global patterns. All handcrafted by denkwerk.",
            "In the frontend department, we created a living style guide, based on the module catalog made by the UX and visual designer. This living style guide was a list of global definitions, patterns, modules, and example pages. As global definitions we specified general configuration which everything is based on later, containing i.e. font families, font sizes, colours, grid, indents, breakpoints, margins, and animation time functions. The beauty of these configurations is the possibility to alter the whole theme within seconds. That's how we created the Carolus brand site, only by changing colour, font families and other settings.",
            "I'm very thank full to had a part of these projects, my UI easter egg which is the main navigation. Which has a drop down navigation on hover, a tricky piece. The problem? Not closing the submenu accidentally by hovering over another main menu entry when the mouse is one the way to a sub menu entry diagonally placed to its parent. Preventing this is usually solved with a time out which activates on leaving a main item. it solves the problem for fast user with a fast movement. Not only it doesn't work for slow mouse movements, as well it makes it not responsive. A mouse direction detection is used. Spanning a triangle from the current mouse position by entering a main menu entry to the top left and top right corner of the submenu. If the mouse is staying it the triangle, even hovering over another main menu entry, the submenu stays open. This technique is invented by Apple and used by amazon.com at their navigation.",
            "And lastly the Gedore shop, which is OXID and smarty templates. We created a living style guide, out of smarty modules and patterns, each can be easily included in to the page, and modified through parameters."
        ],
        "images": [
            {
                "src": "img/content/project/gedore/gedore.jpg"
            },
            {
                "src": "img/content/project/gedore/carolus.jpg"
            },
            {
                "src": "img/content/project/gedore/theme.jpg"
            },
            {
                "src": "img/content/project/gedore/navigation.jpg"
            },
            {
                "src": "img/content/project/gedore/shop.jpg"
            }
        ],
        "links": [
            "gedore.com",
            "carolus.de",
            "de.gedore-shop.com"
        ]
    },
    {
        "title": "Zwilling",
        "year": "2015",
        "duration": "3 months",
        "tags": [
            "frontend",
            "modules",
            "task runner"
        ],
        "previewImg": {
            "src": "img/content/project/preview/zwilling_preview_large.jpg"
        },
        "descriptions": [
            "New at denkwerk and had to step right into development of new modules for Zwilling. Later on I was in charge of setting up Grunt pipelines for recurring dev tasks. It was a project including Zwilling online shop, Zwilling, Miyabi, Demeyere and Staub brand website. I was helping out in all five projects to fix bugs and create minor modules."
        ],
        "images": [
            {
                "src": "img/content/project/zwilling/shop.jpg"
            },
            {
                "src": "img/content/project/zwilling/miyabi.jpg"
            },
            {
                "src": "img/content/project/zwilling/demeyere.jpg"
            },
            {
                "src": "img/content/project/zwilling/staub.jpg"
            }
        ],
        "links": [
            "www.zwilling.com"
        ]
    },
    {
        "title": "UNESCO New Baraka",
        "year": "2016",
        "duration": "1 month",
        "tags": [
            "PHP",
            "JS",
            "Animation",
            "ScrollMagic"
        ],
        "previewImg": {
            "src": "img/content/project/preview/baraka_preview_large.jpg"
        },
        "descriptions": [
            "I enjoyed developing the mobile version of the donation platform. Happy animated illustrations and sounds effects making the purpose of the product easy to understand.",
            "The website applied for Red Dot Awards and won in 'Online', 'E-Commerce' and 'Social Responsibility'. Later the PAGE, a German magazine, which publishes articles about design, technology, and business, published an article about the platform New Baraka, it got printed in the 07.2016 issue."
        ],
        "images": [
            {
                "src": "img/content/project/baraka/1.jpg"
            },
            {
                "src": "img/content/project/baraka/3.jpg"
            },
            {
                "src": "img/content/project/baraka/4.jpg"
            }
        ],
        "links": [
            "new-baraka.com"
        ]
    },
    {
        "title": "Jacques Weindepot",
        "year": "2016",
        "duration": "6 months",
        "tags": [
            "AngularJS",
            "SCSS",
            "Java"
        ],
        "previewImg": {
            "src": "img/content/project/preview/jacques_preview_large.jpg",
            "title": "previewImg"
        },
        "descriptions": [
            "At denkwerk, a cooperation with Jacques' IT in making a mobile website of the already existing desktop version. The UX team encounter the challenge of rebuild desktop features for the mobile context. We as frontend developer transferred the wire-frames to static HTML, JS, and CSS. Which later Jacques' IT integrated to their shop platform."
        ],
        "images": [
            {
                "src": "img/content/project/jacques/1.jpg"
            }
        ],
        "links": [
            "www.jacques.de"
        ]
    },
    {
        "title": "Car2Go",
        "year": "2016",
        "duration": "6 months",
        "tags": [
            "AngularJS",
            "SCSS",
            "HTML5"
        ],
        "previewImg": {
            "src": "img/content/project/preview/car2go_preview_large.jpg"
        },
        "descriptions": [
            "Car2Go commissioned denkwerk of improving the usability of the sign up form."
        ],
        "images": [
            {
                "src": "img/content/project/car2go/1.jpg"
            }
        ]
    }
]
